In [2]:

import pandas as pd
course_name = ["Data Science", "Machine Learning", "Big Data", "Data Engineer"]
duration = [2,3,6,4]
df = pd.DataFrame(data = {"course_name" : course_name, "duration" : duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

### Q1. Write a code to print the data present in the second row of the dataframe, df.

In [6]:
df.loc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

### Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

In [7]:
# loc uses labels/column names to index data
print("Using loc with labels:")
print(df.loc[1, "course_name"])  # Gets "Machine Learning" using row label 1 and column name

# iloc uses integer positions to index data 
print("\nUsing iloc with integer positions:")
print(df.iloc[1, 0])  # Gets "Machine Learning" using row position 1 and column position 0

# Demonstrating the difference:
print("\nComparing loc vs iloc:")
print("df.loc[1] gets row with label 1:")
print(df.loc[1])
print("\ndf.iloc[1] gets row at position 1:")
print(df.iloc[1])

Using loc with labels:
Machine Learning

Using iloc with integer positions:
Machine Learning

Comparing loc vs iloc:
df.loc[1] gets row with label 1:
course_name    Machine Learning
duration                      3
Name: 1, dtype: object

df.iloc[1] gets row at position 1:
course_name    Machine Learning
duration                      3
Name: 1, dtype: object

### Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2].

In [9]:
new_df = df.reindex([3,0,1,2])

In [10]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [11]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [12]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [13]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.653141  0.472734  0.890009  0.594020  0.744085  0.385510
2  0.246144  0.659297  0.282945  0.210329  0.089111  0.748244
3  0.746637  0.288289  0.816939  0.211705  0.173440  0.425282
4  0.662485  0.317475  0.879477  0.790525  0.731910  0.787788
5  0.669516  0.629552  0.695916  0.484500  0.693349  0.418482
6  0.468642  0.039412  0.508235  0.300475  0.523147  0.824667

### Q4. Write a code to find the following statistical measurements for the above dataframe df1:
- (i) mean of each and every column present in the dataframe.
- (ii) standard deviation of column, ‘column_2’

In [16]:
# (i) Mean of each column
print("Mean of each column:")
print(df1.mean())

Mean of each column:
column_1    0.574428
column_2    0.401126
column_3    0.678920
column_4    0.431926
column_5    0.492507
column_6    0.598329
dtype: float64

In [17]:
df1['column_2'].std()

np.float64(0.23431802437117946)

### Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2. If you are getting errors in executing it then explain why.
***[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]***

In [19]:
df1.iloc[1, 1] = 'anuj'

C:\Users\anujk\AppData\Local\Temp\ipykernel_3288\3507680497.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'anuj' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df1.iloc[1, 1] = 'anuj'

In [21]:
# df1['column_2'].mean() #TypeError: unsupported operand type(s) for +: 'float' and 'str'

### Q6. What do you understand about the windows function in pandas and list the types of windows functions?

In [1]:
# Windows functions in pandas allow us to perform calculations on a subset of rows (window) that are related to the current row
# They are useful for calculating running totals, moving averages, rankings etc.

# Common types of window functions:
# 1. Rolling window functions
print("\nRolling window example (3-day moving average):")
dates = pd.date_range('2023-01-01', periods=5)
data = pd.Series([10, 20, 15, 30, 25], index=dates)
print(data.rolling(window=3).mean())

# 2. Expanding window functions 
print("\nExpanding window example (cumulative mean):")
print(data.expanding().mean())

# 3. Exponentially weighted window functions
print("\nExponentially weighted window example:")
print(data.ewm(span=2).mean())

# Other common window functions include:
# - shift() and diff() for lagged calculations
# - rank() for ranking values
# - cumsum(), cumprod() for cumulative calculations
# - pct_change() for percentage changes

Rolling window example (3-day moving average):

NameError: name 'pd' is not defined

In [4]:
# Create sample data
import pandas as pd
customers_data = {
    'id': [1, 2, 3, 4],
    'name': ['Joe', 'Henry', 'Sam', 'Max']
}
orders_data = {
    'id': [1, 2],
    'customerId': [3, 1] 
}

# Create DataFrames
customers_df = pd.DataFrame(customers_data)
orders_df = pd.DataFrame(orders_data)

# Find customers who never ordered
# Using left join and checking for null values in orders table
result = customers_df.merge(orders_df, 
                          left_on='id', 
                          right_on='customerId', 
                          how='left')
customers_no_orders = result[result['customerId'].isna()]

print("\nCustomers who never ordered:")
print(customers_no_orders)
result

Customers who never ordered:
   id_x   name  id_y  customerId
1     2  Henry   NaN         NaN
3     4    Max   NaN         NaN

   id_x   name  id_y  customerId
0     1    Joe   2.0         1.0
1     2  Henry   NaN         NaN
2     3    Sam   1.0         3.0
3     4    Max   NaN         NaN

In [6]:
customers_df

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [7]:
orders_df

   id  customerId
0   1           3
1   2           1

In [10]:
customers_df.merge(orders_df, left_on='id', right_on='customerId', how='left')

   id_x   name  id_y  customerId
0     1    Joe   2.0         1.0
1     2  Henry   NaN         NaN
2     3    Sam   1.0         3.0
3     4    Max   NaN         NaN

In [11]:
customers_df.merge(orders_df, left_on='id', right_on='customerId', how='right')

   id_x name  id_y  customerId
0     3  Sam     1           3
1     1  Joe     2           1

In [12]:
customers_df.merge(orders_df, left_on='id', right_on='customerId', how='inner')

   id_x name  id_y  customerId
0     1  Joe     2           1
1     3  Sam     1           3

In [14]:
df = customers_df.merge(orders_df, left_on='id', right_on='customerId', how='outer')

In [15]:
df

   id_x   name  id_y  customerId
0     1    Joe   2.0         1.0
1     2  Henry   NaN         NaN
2     3    Sam   1.0         3.0
3     4    Max   NaN         NaN

In [16]:
df.columns = ['id', 'Customers', 'CustomerId', 'OrderId']

In [17]:
df

   id Customers  CustomerId  OrderId
0   1       Joe         2.0      1.0
1   2     Henry         NaN      NaN
2   3       Sam         1.0      3.0
3   4       Max         NaN      NaN

In [18]:
# pandas merge operations
data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
df = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})
df

   actor_id  director_id  timestamp
0         1            1          0
1         1            1          1
2         1            1          2
3         1            2          3
4         1            2          4
5         2            1          5
6         2            1          6

In [47]:
result = df.groupby(['actor_id', 'director_id'])
result[result.count()>=3].reset_index()
# result>=3

TypeError: unhashable type: 'DataFrame'

In [35]:
# Get pairs where count >= 3 and reset index to get as columns
result = df.groupby(['actor_id', 'director_id']).size()
result = result[result >= 3].reset_index()

# Rename columns to match expected output
result.columns = ['actor_id', 'director_id', 'count'] 

# Drop the count column since we only need the pairs
result = result[['actor_id', 'director_id']]
result

   actor_id  director_id
0         1            1

In [50]:
result = df.groupby(['actor_id', 'director_id']).size()
result

actor_id  director_id
1         1              3
          2              2
2         1              2
dtype: int64

In [54]:
result[result>=3].reset_index()[['actor_id', 'director_id']]

   actor_id  director_id
0         1            1

In [55]:
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})
person

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [56]:
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [61]:
person.merge(address, on='personId', how='left').drop(['addressId', 'personId'], axis=1)

  firstName lastName           city     state
0      Wang    Allen            NaN       NaN
1     Alice      Bob  New York City  New York

In [62]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

In [63]:
employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [75]:
employee['managerId'].apply(lambda x: employee[employee['id']==x])

0       id name  salary  managerId
2   3  Sam   600...
1       id name  salary  managerId
3   4  Max   900...
2    Empty DataFrame
Columns: [id, name, salary, ma...
3    Empty DataFrame
Columns: [id, name, salary, ma...
Name: managerId, dtype: object

In [66]:
employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [67]:
employee['id']==3

0    False
1    False
2     True
3    False
Name: id, dtype: boolean

In [71]:
employee[employee['id']==3]['salary']

2    60000
Name: salary, dtype: Int64

In [76]:
# Get employees with managers by filtering out null managerId
employees_with_managers = employee[employee['managerId'].notna()]

# Merge employee table with itself to get manager salaries
result = employees_with_managers.merge(
    employee[['id', 'salary']], 
    left_on='managerId',
    right_on='id',
    suffixes=('_employee', '_manager')
)

# Filter for employees who earn more than their managers
higher_paid = result[result['salary_employee'] > result['salary_manager']]

# Select relevant columns
higher_paid[['name', 'salary_employee']]

  name  salary_employee
0  Joe            70000

In [77]:
result

   id_employee   name  salary_employee  managerId  id_manager  salary_manager
0            1    Joe            70000          3           3           60000
1            2  Henry            80000          4           4           90000